/** @type {import('tailwindcss').Config} */
export default {
  content: [
    "./components/**/*.{js,ts,jsx,tsx}",
    "./types/**/*.{js,ts,jsx,tsx}"
  ],
  prefix: 'u-',
  theme: {
    extend: {
      colors: {
        // 灰色系列
        gray: {
          0: '#FFFFFF',    // 1.09:1
          100: '#F5F5F5',  // 1:1
          150: '#E7E7E7',  // 1.13:1
          200: '#D9D9D9',  // 1.29:1
          300: '#BDBDBD',  // 1.72:1
          400: '#A3A3A3',  // 2.31:1
          500: '#898989',  // 3.21:1
          600: '#707070',  // 4.53:1
          700: '#5C5C5C',  // 6.13:1
          800: '#494949',  // 8.26:1
          900: '#373737',  // 10.92:1
          1000: '#262626', // 13.88:1
          1100: '#000000', // 19.26:1
        },
        // 綠色系列
        green: {
          100: '#E9F8F0',  // 1:1
          150: '#CBEFDC',  // 1.13:1
          200: '#ADE6C7',  // 1.29:1
          300: '#6ED09B',  // 1.72:1
          400: '#3BB875',  // 2.31:1
          500: '#1D9C58',  // 3.21:1
          600: '#0F8144',  // 4.53:1
          700: '#0A6A36',  // 6.13:1
          800: '#06542A',  // 8.26:1
          900: '#044020',  // 10.92:1
          1000: '#032C16', // 13.88:1
        },
        // 藍色系列
        blue: {
          100: '#E9F6FE',  // 1:1
          150: '#CAECFF',  // 1.12:1
          200: '#AAE1FF',  // 1.29:1
          300: '#67C7FB',  // 1.72:1
          400: '#35ADED',  // 2.31:1
          500: '#1890D2',  // 3.21:1
          600: '#0C76B0',  // 4.53:1
          700: '#076193',  // 6.13:1
          800: '#044D75',  // 8.26:1
          900: '#033A59',  // 10.92:1
          1000: '#02293D', // 13.88:1
        },
        // 紫色系列
        purple: {
          100: '#F3F4FF',  // 1:1
          150: '#E3E6FF',  // 1.12:1
          200: '#D3D7FF',  // 1.29:1
          300: '#B2B8FF',  // 1.72:1
          400: '#929BFE',  // 2.31:1
          500: '#757EEC',  // 3.21:1
          600: '#5E66CC',  // 4.53:1
          700: '#4C53AC',  // 6.13:1
          800: '#3C418A',  // 8.26:1
          900: '#2D3169',  // 10.92:1
          1000: '#1F2249', // 13.88:1
        },
        // 紅色系列
        red: {
          100: '#FDF2F2',  // 1:1
          150: '#FCE1E1',  // 1.12:1
          200: '#FACFCF',  // 1.29:1
          300: '#F7A9A9',  // 1.72:1
          400: '#F38282',  // 2.31:1
          500: '#EC5555',  // 3.21:1
          600: '#DD1B1B',  // 4.53:1
          700: '#BC0000',  // 6.13:1
          800: '#970000',  // 8.26:1
          900: '#750000',  // 10.92:1
          1000: '#550000', // 13.88:1
        },
        // 橙色系列
        orange: {
          100: '#FFF3E6',  // 1:1
          150: '#FFE2C2',  // 1.13:1
          200: '#FFD19D',  // 1.29:1
          300: '#FFAB50',  // 1.72:1
          400: '#F28815',  // 2.31:1
          500: '#D56C00',  // 3.21:1
          600: '#B25700',  // 4.53:1
          700: '#944600',  // 6.13:1
          800: '#763700',  // 8.26:1
          900: '#592A00',  // 10.92:1
          1000: '#3F1D00', // 13.88:1
        },
        // 半透明
        transparent: {
          light: 'rgba(255, 255, 255, 0.9)',
          DEFAULT: 'transparent',
          dark: 'rgba(0, 0, 0, 0.9)',
        },
        // 主題顏色別名
        primary: {
          light: '#0C76B0', // blue-600
          DEFAULT: '#044D75', // blue-800
          dark: '#02293D', // blue-1000
          hover: "#033A59", // blue-900
        },
        secondary: {
          light: '#67C7FB', // blue-300
          DEFAULT: '#35ADED', // blue-400
          dark: '#044D75', // blue-800
        },
        error: {
          light: '#F7A9A9', // red-300
          DEFAULT: '#DD1B1B', // red-600
          dark: '#750000', // red-900
        },
        warning: {
          light: '#FFAB50', // orange-300
          DEFAULT: '#B25700', // orange-600
          dark: '#592A00', // orange-900
        },
        info: {
          light: '#67C7FB', // blue-300
          DEFAULT: '#0C76B0', // blue-600
          dark: '#02293D', // blue-1000
        },
        success: {
          light: '#6ED09B', // green-300
          DEFAULT: '#0F8144', // green-600
          dark: '#044020', // green-900
        },
      },
      fontFamily: {
        sans: ['Noto Sans TC', 'sans-serif'],
        roboto: ['Roboto', 'sans-serif'],
      },
      fontWeight: {
        thin: '100',
        extralight: '200',
        light: '300',
        normal: '400',
        medium: '500',
        semibold: '600',
        bold: '700',
        extrabold: '800',
        black: '900',
      },
      fontSize: {
        xs: '0.75rem',    // 12px
        sm: '0.875rem',   // 14px
        base: '1rem',     // 16px
        lg: '1.125rem',   // 18px
        xl: '1.25rem',    // 20px
        '2xl': '1.5rem',  // 24px
        '3xl': '1.875rem',// 30px
        '4xl': '2.25rem', // 36px
      },
      borderRadius: {
        none: '0',
        sm: '0.125rem',   // 2px
        DEFAULT: '0.25rem',// 4px
        md: '0.375rem',   // 6px
        lg: '0.5rem',     // 8px
        xl: '0.75rem',    // 12px
        '2xl': '1rem',    // 16px
        full: '9999px',
      },
      boxShadow: {
        sm: '0 1px 2px 0 rgba(0, 0, 0, 0.05)',
        DEFAULT: '0 1px 3px 0 rgba(0, 0, 0, 0.1), 0 1px 2px 0 rgba(0, 0, 0, 0.06)',
        md: '0 4px 6px -1px rgba(0, 0, 0, 0.1), 0 2px 4px -1px rgba(0, 0, 0, 0.06)',
        lg: '0 10px 15px -3px rgba(0, 0, 0, 0.1), 0 4px 6px -2px rgba(0, 0, 0, 0.05)',
        xl: '0 20px 25px -5px rgba(0, 0, 0, 0.1), 0 10px 10px -5px rgba(0, 0, 0, 0.04)',
      },
    },
  },
  plugins: [],
}; 